[{"title": "What is a Data Warehouse?", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/what-is-a-data-warehouse/", "datetime": "2021-10-03T18:33:54-0400", "summary": "Unclear what a data warehouse is or when to use one? Then this post is for you. In this post, we go over what a data warehouse is, the need for it, and the differences between using an OLTP and OLAP database as a data warehouse."}, {"title": "dbt(Data Build Tool) Tutorial", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/dbt-data-build-tool-tutorial/", "datetime": "2021-09-29T21:00:00Z", "summary": "DBT (data build tool) tutorial. Build a project simulating a real life ELT project using the data build tool."}, {"title": "How to Scale Your Data Pipelines", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/scale-data-pipelines/", "datetime": "2021-09-16T09:25:34-0400", "summary": "Confused by all the tools and frameworks available to scale your data pipeline? Then this post is for you. In this post, we go over what scaling is, the different types of scaling, and how to choose scaling strategies for your data pipelines. By the end of this post, you will be able to come up with the correct scaling strategy for any data pipeline."}, {"title": "Understand & Deliver on Your Data Engineering Task", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/how-to-deliver-on-your-de-tasks/", "datetime": "2021-08-29T10:26:47-0400", "summary": "Want to deliver on your data engineering tasks with confidence? Then this post is for you. In this post, we go over a list of steps that you can use to understand what your assigned work is, why it matters and how to deliver great work."}, {"title": "4 Key Patterns to Load Data Into A Data Warehouse", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/patterns-to-load-data-into-data-warehouse/", "datetime": "2021-08-17T19:39:46-0400", "summary": "Unsure how to load data into a data warehouse? Then this post is for you. In this post, we go over 4 key patterns to load data into a data warehouse. These patterns can help you build resilient and easy-to-use data pipelines. Level up as a data engineer and deliver usable data faster!"}, {"title": "How to Validate Datatypes in Python", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/how-to-validate-datatypes-in-python/", "datetime": "2021-07-21T09:46:44-0400", "summary": "Frustrated with handling data type conversion issues in python? Then this post is for you. In this post, we go over a reusable data type conversion pattern using Pydantic. We will also go over the caveats involved in using this library."}, {"title": "Designing a Data Project to Impress Hiring Managers", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/data-engineering-project-to-impress-hiring-managers/", "datetime": "2021-06-25T20:08:38-0400", "summary": "Frustrated that hiring managers are not reading your Github projects? then this post is for you. In this post, we discuss a way to impress hiring managers by hosting a live dashboard with near real-time data. We will also go over coding best practices such as project structure, automated formatting, and testing to make your code professional. By the end of this post, you will have deployed a live dashboard that you can link to your resume and LinkedIn."}, {"title": "How to add tests to your data pipelines", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/how-to-add-tests-to-your-data-pipeline/", "datetime": "2021-06-13T10:48:53-0400", "summary": "Trying to incorporate testing in a data pipeline? This post is for you. In this post, we go over 4 types of tests to add to your data pipeline to ensure high-quality data. We also go over how to prioritize adding these tests, while developing new features."}, {"title": "How to make data pipelines idempotent", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/why-how-idempotent-data-pipeline/", "datetime": "2021-05-13T07:30:13-0400", "summary": "Unable to find practical examples of idempotent data pipelines? Then, this post is for you. In this post, we go over a technique that you can use to make your data pipelines professional and data reprocessing a breeze."}, {"title": "Writing memory efficient data pipelines in Python", "author": "Start Data Engineering", "url": "https://www.startdataengineering.com/post/writing-memory-efficient-dps-in-python/", "datetime": "2021-04-26T20:20:48-0400", "summary": "Working with a dataset that is too large to fit in memory? Then this post is for you. In this post, we will write memory efficient data pipelines using python generators. We also cover the common generator patterns you will need for your data pipelines."}]
